### **Import Libraries & Setup**

In [1]:
import pgspecial

In [2]:
%load_ext sql
%sql postgresql+psycopg2://anthony:Huangjianen611!@localhost:5432/poros

In [4]:
%%sql

\d

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
6 rows affected.

[('public', 'campaign', 'table', 'anthony'),
 ('public', 'customer', 'table', 'anthony'),
 ('public', 'orderline', 'table', 'anthony'),
 ('public', 'orders', 'table', 'anthony'),
 ('public', 'product', 'table', 'anthony'),
 ('public', 'suspend_acct', 'table', 'anthony')]

---

**3. Insert two new customer to the customer table**

In [ ]:
%%sql

INSERT INTO customer(customer_id, household_id, gender, first_name) VALUES
(1111, 111111, 'M', 'Vince');

In [ ]:
%%sql

UPDATE customer 
SET household_id = 222222, gender = 'F', first_name = 'Lucy' 
WHERE customer_id = 2222;

In [51]:
%%sql 

SELECT *
FROM customer
WHERE customer_id = 1111 or customer_id = 2222;

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
3 rows affected.

[(1111, 20269112, None, 'R.'),
 (1111, 111111, 'M', 'Vince'),
 (2222, 222222, 'F', 'Lucy')]

---

**4. The name of the new customer called Vince has a typo mistake, please revise the name as Vincent using update statement**

In [ ]:
%%sql 

UPDATE customer
SET first_name = 'Vincent'
WHERE customer_id = 1111 and household_id = 111111;

In [56]:
%%sql

SELECT * 
FROM customer
WHERE first_name = 'Vincent';

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
1 rows affected.

[(1111, 111111, 'M', 'Vincent')]

---

**5. your manager told you that he has a customer table that contains all suspended customers he would like to do the below tasks:**

- create a indicator variable called suspended_ind to those suspended customers in the suspended customer table as value 'Y'

In [ ]:
%%sql

ALTER TABLE suspend_acct ADD COLUMN suspend_ind VARCHAR(2);

In [ ]:
%%sql

UPDATE suspend_acct SET suspend_ind = 'Y';

In [74]:
%%sql

SELECT * FROM suspend_acct LIMIT 5;

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
5 rows affected.

[(174596, 53949999, 'M', 'DANIEL', 'Y'),
 (68239, 49927024, 'M', 'JIM', 'Y'),
 (10203, 20914414, 'F', 'DONNA', 'Y'),
 (174288, 53957047, 'F', 'DIONE', 'Y'),
 (68099, 49927024, 'M', 'JIM', 'Y')]

- after creating the indicator variable - suspended_ind in suspended customer table, then append this indicator variable/new field to the final full analysis table

- for those who has no value in the suspended_ind, update the missing value as 'N'

In [ ]:
%%sql

ALTER TABLE customer ADD COLUMN suspended_ind VARCHAR(2);

In [ ]:
%%sql

UPDATE customer
SET suspended_ind = CASE
      WHEN 
         (customer_id, household_id) in (SELECT customer_id, household_id FROM suspend_acct)
      THEN 'Y'
      ELSE 'N'
   END;

In [82]:
%%sql

SELECT * FROM customer ORDER BY customer_id LIMIT 5;

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
5 rows affected.

[(1, 20516395, 'F', 'EILEEN', 'N'),
 (2, 20346368, 'F', 'ENID', 'N'),
 (3, 19038361, 'F', 'ANNA', 'N'),
 (4, 18572491, None, 'L.', 'N'),
 (5, 18792705, None, 'J.', 'N')]

- Managers would like to see full information for those suspended customers from the full analysis table ( filter the suspended customers out)

In [3]:
%%sql

SELECT * FROM customer WHERE suspended_ind = 'N' LIMIT 10;

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
10 rows affected.

[(446, 18715207, None, 'PAT', 'N'),
 (1023, 20839216, 'F', 'ELIZABETH', 'N'),
 (1766, 19354060, 'M', 'C.', 'N'),
 (2045, 21615687, None, None, 'N'),
 (2189, 20677314, 'M', 'ROBERT', 'N'),
 (3360, 19392693, None, 'K.', 'N'),
 (4980, 18557234, None, 'M.', 'N'),
 (6279, 18859015, 'F', 'PAM', 'N'),
 (7889, 18610258, None, 'J.', 'N'),
 (8657, 19819810, 'M', 'ALI', 'N')]

---

**6. your manager give you a new table called high_value_acct(suspended customers), he would like you to do the list below**

- save a copy of customer table called customer1

- save another copy of customer table called customer2

- add the high_value_acct customers to customer1 table by using union all statement

In [ ]:
%%sql

CREATE TABLE customer1 AS
(SELECT *
FROM customer
UNION ALL
SELECT * 
FROM suspend_acct);

- add the high_value_acct customers to customer2 table by using union statement

In [ ]:
%%sql

CREATE TABLE customer2 AS
(SELECT *
FROM customer
UNION
SELECT * 
FROM suspend_acct);

- what is the difference between customer1 and customer2 tables

In [29]:
%%sql

SELECT 
   (SELECT COUNT(*) FROM customer1) AS total_customer_union_all,
   (SELECT COUNT(*) FROM customer2) AS total_customer_union

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
1 rows affected.

[(189660, 189560)]

**There are 100 more records in customer2 table than in customer1 table**

- prove to the manager that the high value customers has been added to the table customer1 - 
in order to prove to the manager, you need to create a table called customer3 and comparing customer1 and high_value_acct  table

In [ ]:
%%sql

DROP TABLE IF EXISTS customer3;

CREATE TABLE customer3 AS 
(SELECT *
FROM customer1
EXCEPT ALL
SELECT * 
FROM suspend_acct);

In [43]:
%%sql

SELECT *
FROM customer3
EXCEPT 
SELECT * 
FROM customer;

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
0 rows affected.

[]

- show to the manager, which customers are new high value customers when comparing original customer table and high_value_acct table, please create a new table called customer4 to answer the question

In [ ]:
%%sql

CREATE TABLE customer4 AS 
(
   SELECT *
   FROM customer
   INTERSECT 
   SELECT *
   FROM suspend_acct
);

In [45]:
%%sql 

SELECT * FROM customer4 LIMIT 10;

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
10 rows affected.

[(174766, 53968873, 'M', 'WALLACE', 'Y'),
 (174595, 53949997, 'F', 'MARGARET', 'Y'),
 (133296, 36202174, 'M', 'HUGH', 'Y'),
 (15543, 20738900, 'M', 'FRANK', 'Y'),
 (174257, 53949983, 'F', 'TRISHA', 'Y'),
 (174267, 41242786, 'M', 'RUSSELL', 'Y'),
 (174650, 53958894, 'M', 'GREG', 'Y'),
 (174261, 53951355, 'F', 'KAYE', 'Y'),
 (174288, 53957047, 'F', 'DIONE', 'Y'),
 (174698, 53966525, 'F', 'SUSAN', 'Y')]

---

**7. please find the customer who paid the highest total price, and also find the household who paid the highest total price among all its customers**

In [69]:
%%sql

SELECT c.customer_id, c.household_id, o.total_price
FROM customer c
JOIN orders o
ON c.customer_id = o.customer_id
ORDER BY o.total_price DESC
LIMIT 1;

 * postgresql+psycopg2://anthony:***@localhost:5432/poros
1 rows affected.

[(146401, 18442778, 9848.96)]

---